[
  {
    "id": "faq_001",
    "title": "loomlock user manual",
    "link": "",
    "content": "The Loomlock operates on a 3.7V rechargeable battery, charged via USB. It features three main modes: Edit Time, Locking, and Lock End. In Edit Time mode, users can configure minutes (“Edit: MM”), hours (“Edit: HH”), and days (“Edit: DD”) using plus/minus buttons. Holding both buttons under 2 seconds cycles through these states. Tapping the buttons adjusts values incrementally, while holding them changes values continuously. The range is 0–59 for minutes, 0–23 for hours, and 0–9 for days (maximum lock time: 10 days). To activate the lock, users must be in “Edit: DD” and hold both buttons for over 4 seconds. This initiates Locking mode, during which the display shows the countdown—either in Days/Hours/Minutes or Hours/Minutes/Seconds depending on remaining time. When the timer hits zero, the device enters Lock End mode and displays all zeroes. Unlocking is only possible in Lock End mode by again holding both buttons for over 4 seconds, returning the device to “Edit: MM.” The battery status is indicated by bars (“=”, “==”, etc.), with four levels shown while discharging and animated bar progression during charging. Voltage from 4.2V to 3.3V maps to charge levels. If idle for 20 seconds (and not charging), the Loomlock enters sleep mode and wakes via button press, USB power, or timer completion. The screen can be flipped 180° by holding both buttons for 4 seconds while in “Edit: HH.” Additionally, a soft lock function triggers the locking pins without starting a timer by holding both buttons for 5 seconds in “Edit: MM.”"
  },
  {
    "id": "faq_002",
    "title": "What is blessnet?",
    "link": "",
    "content": "Blessnet is a safety layer built ontop of the EVM that enables drainproof transacting, letting people have fun and play onchain in a much safer environment. It’s the backend that enables loomlock’s crypto side to have such a seamless and modular user flow."
  },
  {
    "id": "faq_003",
    "title": "What is voting?",
    "link": "",
    "content": "Pursuing community-led product vision, loomlock lets users to decide on the new lock design drops. Voting Addresses (and their delegates) owning loomlocknft’s are eligible to vote. When the $LOCKS drop occurs, this will transition to owners of $LOCKS and loomlock redemption NFTs (redeemed and unredeemed)."
  },
  {
    "id": "faq_004",
    "title": "What is raffle?",
    "link": "",
    "content": "As loomlock, we want the community to help decide the direction our crypto designs take. as $LOCKS holders will ultimately be the people redeeming the physical collectible locks, we will let them pick which locks they want to mint. Raffles are in two stages: The first stage is the winner loser stage. This is where designs will be pitted against each other. Users can vote using their $LOCKS token on the lock they WANT to mint. If they vote correctly, they will be able to take part in a raffle to mint that design. If they chose incorretly, then they will have to wait till the winners raffle is concluded, and if there’s any locks left over they will be available on a FCFS basis."
  },
  {
    "id": "faq_005",
    "title": "What is community submissions",
    "link": "",
    "content": "Community submissions are designs or concepts for Loomlocks created by the community. There's a period for community submissions creation, followed by voting on these submissions. This allows the community to participate in creating new loomlock designs?"
  },
  {
    "id": "faq_006",
    "title": "What is Loomlock?",
    "link": "",
    "content": "Loomlock is a physical, timed locking container designed to help individuals manage distractions and impulsive behaviors. At its core, it's a box with a built-in electronic timer that, once set and activated, cannot be opened until the timer reaches zero (unless emergency-access plastic pins are used, which can be broken). The primary purpose of Loomlock is to facilitate \"precommitment\"—allowing you to make a rational decision to restrict access to certain items before you're in a moment of weakness or temptation. By physically removing an item from your immediate reach for a predetermined period, Loomlock creates a barrier against easy gratification, aiding in focus, habit formation, and self-control. It’s a tangible tool that acts as an external aid to willpower, helping you stick to your intentions by making it temporarily impossible to access things like smartphones, snacks, or other items you wish to limit your use of."
  },
  {
    "id": "faq_007",
    "title": "Who is Loomlock for?",
    "link": "",
    "content": "Loomlock is a physical, timed locking container designed to help individuals manage distractions and impulsive behaviors. At its core, it's a box with a built-in electronic timer that, once set and activated, cannot be opened until the timer reaches zero (unless emergency-access plastic pins are used, which can be broken). The primary purpose of Loomlock is to facilitate \"precommitment\"—allowing you to make a rational decision to restrict access to certain items before you're in a moment of weakness or temptation. By physically removing an item from your immediate reach for a predetermined period, Loomlock creates a barrier against easy gratification, aiding in focus, habit formation, and self-control. It’s a tangible tool that acts as an external aid to willpower, helping you stick to your intentions by making it temporarily impossible to access things like smartphones, snacks, or other items you wish to limit your use of."
  },
  {
    "id": "faq_008",
    "title": "Why should I use loomlock instead of just using self-discipline?",
    "link": "",
    "content": "While self-discipline is a valuable trait, it's also a finite resource that can be depleted by stress, fatigue, or overwhelming temptation. Loomlock, a physical timed locking container, acts as a structural support for your self-discipline rather than a replacement for it. It operates on the principle of \"precommitment\"—you use your self-discipline in a moment of strength and clarity to lock away a distracting item. Once Loomlock is engaged, it takes over the \"guarding\" duty, meaning you no longer need to actively exert willpower to resist that specific temptation for the duration the timer is set. This is powerful because willpower is often weakest when temptation is strongest. Relying solely on self-discipline means constantly battling urges in real-time. Loomlock allows you to make a binding decision ahead of time, effectively removing the battle before it begins. It's about strategically managing your environment to make your desired behaviors easier and undesired behaviors harder, conserving your mental energy for other important tasks."
  },
  {
    "id": "faq_009",
    "title": "What kinds of things can I lock away with Loomlock?",
    "link": "",
    "content": "Loomlock is a versatile physical timelocking container designed to secure any item that fits inside its compartment and that you wish to temporarily restrict your access to. The primary candidates are items that frequently cause distraction, lead to impulsive behavior, or derail your personal goals. Common examples include smartphones, especially if you're trying to reduce screen time or focus on work. Other digital distractions like game controllers, TV remotes, or tablets are also suitable. Beyond electronics, Loomlock can be used for food items such as tempting snacks, sweets, or cigarettes and vape pens if you're trying to cut down or quit. People also use it for credit cards to curb impulsive spending, or even alcohol to manage consumption. Essentially, if an item's immediate availability undermines your well-being, productivity, or long-term objectives, and it physically fits, Loomlock can help you create a necessary period of separation from it."
  },
  {
    "id": "faq_010",
    "title": "Is Loomlock just for phones, or can it be used for other distractions too?",
    "link": "",
    "content": "Loomlock is definitely not just for phones; its utility extends to a wide variety of items that can act as distractions or temptations. As a physical timelocking container, its core function is to temporarily restrict access to anything placed inside it. While smartphones are a very common item people choose to lock away due to their pervasive nature and potential for distraction, Loomlock is equally effective for managing other sources of impulsivity or habit. For example, you can lock away game controllers, TV remotes, unhealthy snacks, cigarettes, vape pens, credit cards, or even keys to prevent late-night drives if that's a concern. The key principle is \"precommitment\"—if an item's accessibility hinders your focus, productivity, or well-being, and it fits within the Loomlock box, you can use the device to create a helpful barrier. The flexibility of Loomlock lies in its ability to adapt to whatever specific distraction you need to manage."
  },
  {
    "id": "faq_011",
    "title": "How long can I set a lock for?",
    "link": "",
    "content": "You can set the timer on the Loomlock for a period extending up to a maximum of 9 days, 23 hours, and 59 minutes. This substantial maximum duration allows for long-term precommitments, such as locking away a distracting item for an entire work week or over an extended holiday period to truly disconnect. The timer is adjustable, allowing you to select shorter periods as well, suitable for focused work sessions or managing evening routines. The ability to set such a long duration underscores Loomlock's design philosophy: to provide a robust tool that empowers you to make significant, binding decisions about your access to certain items, well in advance of when temptation might strike."
  },
  {
    "id": "faq_012",
    "title": "Can I unlock it early if I really need to?",
    "link": "",
    "content": "Loomlock offers a nuanced approach to early unlocking, which you decide upon at the moment of locking. The system comes with two types of locking pins: metal pins and plastic pins. If you opt to use the metal pins, the Loomlock is designed to be tamper-proof and withstand attempts at early opening; in this case, you are fully committing to waiting until the timer expires. This is for situations where you want no possibility of circumvention. However, for situations where an unforeseen emergency might genuinely require access, you can use the plastic pins. These plastic pins are designed to be breakable under significant force, allowing you to open the Loomlock before the timer ends. This provides an emergency override but involves breaking the pin, thus making the act of early opening a deliberate and conscious decision with a minor consequence (needing a new pin). This dual-pin system allows you to tailor the level of commitment and emergency access to your specific needs each time you use the Loomlock."
  },
  {
    "id": "faq_013",
    "title": "What happens if I forget what I put inside?",
    "link": "",
    "content": "If you forget what specific item you've placed inside your Loomlock you will simply have to wait until the pre-set timer fully counts down and the device unlocks. At that point, the contents will be revealed. Loomlock itself does not have a window or any feature to see inside once it's locked, as this could potentially undermine the commitment by keeping the object visually present. To avoid this situation, especially if you're locking away multiple small items or something you might genuinely forget over a longer lock duration, it's a good practical tip to make a separate, private note for yourself about the contents before you activate the lock. This way, your \"future self\" can be reminded if necessary, without compromising the integrity of the lock period."
  },
  {
    "id": "faq_014",
    "title": "Is Loomlock safe for valuable or sensitive items?",
    "link": "",
    "content": "Loomlock is primarily designed as a behavioral tool to help you manage distractions and impulses by precommitting to restrict access to certain items; it is not engineered to be a high-security safe for valuable or highly sensitive items. While Loomlock, particularly when used with its metal pins, is built to resist casual or impulsive attempts by the owner to open it before the timer expires, its construction is not intended to withstand determined efforts by unauthorized individuals or sophisticated break-in attempts. Therefore, for items of significant monetary value (like expensive jewelry or large sums of cash) or critical sensitivity (like passports or irreplaceable documents), you should always use a dedicated high-grade secure padlock, safe, or other appropriate security device designed specifically for protecting valuables from theft or unauthorized access. Loomlock's strength lies in helping you control your own access, not in protecting items from external threats."
  },
  {
    "id": "faq_015",
    "title": "Can Loomlock actually help improve productivity or mental focus?",
    "link": "",
    "content": "Loomlock can significantly help improve productivity and mental focus by directly addressing one of the primary modern challenges: constant distraction. By deciding in advance to lock away known distractors—such as your smartphone, game controllers, or tempting snacks—you physically remove them from your immediate environment for a set period. This act of removal is powerful because it eliminates the constant, low-level cognitive effort required to resist temptation. When the source of distraction isn't within easy reach, your mind is freer to concentrate on the task at hand. This reduction in environmental temptation can lead to deeper work, reduced procrastination, improved self-control, and even better decision-making, as your mental resources aren't being drained by an ongoing internal battle against impulses. For many, creating this distraction-free bubble is a key step towards enhanced productivity and sustained mental focus."
  },
  {
    "id": "faq_016",
    "title": "Does Loomlock come with an app or is it standalone?",
    "link": "",
    "content": "The Loomlock device itself is intentionally designed to be as standalone as possible for its core functionality. This means you do not need a smartphone app to set the timer, lock the box, or have it unlock once the timer concludes; all these essential operations are managed directly on the physical Loomlock unit. This standalone nature ensures that the very tool designed to help you reduce phone-based distractions doesn't require a phone to operate. However, to enhance the user experience and help individuals gain deeper insights into their habits, Loomlock does offer an optional companion journaling app. This app is recommended for those who wish to track their progress, reflect on their usage patterns, and potentially deepen their understanding and relationship with the product as a tool for behavior change. But to be clear, the app is an optional supplement, and the Loomlock will function perfectly as a timed locking container without it."
  },
  {
    "id": "faq_017",
    "title": "Is there scientific research supporting the effectiveness of precommitment strategies like Loomlock?",
    "link": "",
    "content": "Yes, there is a substantial body of scientific research in psychology and behavioral economics that supports the effectiveness of precommitment strategies, which are the foundational principle behind the Loomlock device. Loomlock, a physical timelock, enables users to make a binding choice to restrict their future access to temptations. This concept, sometimes referred to as a \"commitment device\" or \"Ulysses pact\" (after Odysseus/Ulysses tying himself to the mast), has been studied extensively. Research shows that precommitment helps individuals overcome self-control problems, reduce procrastination, and stick to long-term goals by aligning their present actions with their future desires, especially when faced with immediate gratification. Academic studies have demonstrated that when people voluntarily limit their future options, they are more likely to make choices consistent with their long-term interests. Loomlock leverages these established findings by providing a practical tool to implement such strategies."
  },
  {
    "id": "faq_018",
    "title": "How do I know Loomlock will work for me?",
    "link": "",
    "content": "Loomlock, as a physical timelocking container, is designed to help individuals who struggle with self-control in the face of immediate temptations. If you've ever found yourself regretting giving in to short-term impulses—like endlessly scrolling on your phone when you meant to work, eating snacks you intended to save, or playing games instead of studying—then Loomlock has a high probability of working for you. It functions as an external aid to your willpower by allowing you to make a rational decision (to lock something away) before temptation becomes overwhelming. However, like any tool, its effectiveness is greatest when used intentionally and consistently as part of a broader strategy for behavior change. If you recognize that certain items or habits are derailing your goals, and you're willing to proactively use a tool to create a physical barrier against those distractions, Loomlock can provide the structure needed to help you regain control and focus. It's particularly helpful for those who understand their patterns of weakness and are looking for a practical way to \"outsmart\" their future, more impulsive selves"
  },
  {
    "id": "faq_019",
    "title": "What if there’s an emergency and I need to open the lock?",
    "link": "",
    "content": "Loomlock provides an option for emergency access, the availability of which is determined by the user when they first lock the device. Loomlock units come with two types of locking pins: durable metal pins and single-use plastic pins. If metal pins are used, the commitment is firm, and the box is designed to remain locked until the timer concludes, without an early override. However, if the user anticipates a potential, albeit unlikely, need for emergency access, they can opt to use the plastic pins. These plastic pins are designed to be breakable with sufficient force, allowing the user to open the Loomlock before the timer expires in a genuine emergency. This action would require replacing the pin for future use and makes the decision to override a deliberate one."
  },
  {
    "id": "faq_020",
    "title": "What happens if the battery dies while locked?",
    "link": "",
    "content": "If the internal battery of the Loomlock device depletes while it is in a locked state with the timer still active, the contents will remain securely locked. However, the device is designed for such an eventuality. Users can connect a standard USB-C charger to the Loomlock. This will power the device back on almost immediately, typically within seconds. Importantly, the locking timer is designed to resume from the exact point it was at when the battery died. It does not reset or unlock the device prematurely, ensuring that the precommitment period is upheld as intended once power is restored."
  },
  {
    "id": "faq_021",
    "title": "How big is the compartment? What can fit inside?",
    "link": "",
    "content": "The Loomlock system includes different boxes to accommodate various items that users might wish to secure. There isn't a single standard compartment size for all Loomlock products; rather, variations exist. For example, \"THE OSFA box\" (presumably \"One Size Fits All\" or a specific model name) is described as being spacious enough to hold common hand-held distractions. This typically includes items like smartphones of various sizes, snacks, cigarette packs, keys, wallets, game controllers, and other similar-sized objects that individuals often seek to temporarily remove from their immediate access to improve focus or break habits. Users should check the specifications of the particular Loomlock box model they are considering to understand its exact internal dimensions"
  },
  {
    "id": "faq_022",
    "title": "What psychological principle is Loomlock based on?",
    "link": "",
    "content": "Loomlock is fundamentally built upon the well-established psychological principle of precommitment. This strategy involves making a binding decision in the present to control or limit one's own actions or choices in the future, particularly in situations where one anticipates being tempted by immediate gratification that conflicts with long-term goals. By using Loomlock to physically restrict access to a distracting item for a set duration, individuals are engaging in an act of precommitment. They are essentially making a choice when their rational thinking is dominant (e.g., deciding to focus on work) to constrain their future self who might be more susceptible to impulsive desires (e.g., checking social media). This proactive approach helps to bridge the gap between intention and action, making it easier to adhere to one's goals by removing the option to easily succumb to temptation when willpower might be low."
  },
  {
    "id": "faq_023",
    "title": "What is precommitment, and how does it help with self-control?",
    "link": "",
    "content": "Precommitment is a behavioral strategy where an individual makes a decision in advance to restrict their own future choices, thereby making it harder to engage in undesirable behaviors or easier to stick to desirable ones. It's a way of \"tying one's own hands\" to prevent a future, more impulsive version of oneself from derailing long-term goals. This strategy significantly aids self-control because it acknowledges that willpower can be unreliable, especially when faced with immediate temptations. Instead of relying solely on moment-to-moment resistance, precommitment leverages a period of clear judgment to set up an external constraint. For instance, using a device like Loomlock to lock away a smartphone before a study session is an act of precommitment. Once the phone is locked, the individual no longer needs to actively fight the urge to check it; the decision has already been made and enforced externally. This reduces the cognitive load of constant self-regulation and makes it more likely that the individual will stay focused on their intended task, thereby strengthening self-control over time by consistently aligning actions with goals."
  },
  {
    "id": "faq_024",
    "title": "What is “cheap dopamine” and how does Loomlock fight it?",
    "link": "",
    "content": "\"Cheap dopamine\" refers to the quick, easily accessible, and often low-effort rewards that trigger the release of dopamine, a neurotransmitter associated with pleasure and motivation, in the brain. These rewards typically come from activities like endlessly scrolling through social media, playing simple mobile games, frequently checking notifications, or consuming highly palatable but unhealthy snacks. While these activities provide an immediate sense of pleasure or satisfaction, they often require little real engagement and can lead to cycles of distraction, procrastination, and ultimately, a feeling of unfulfillment. Loomlock, as a physical timed locking container, directly fights the allure of cheap dopamine by creating a physical barrier to the sources of these easy rewards. By locking away a smartphone, game controller, or tempting snacks for a predetermined period, Loomlock temporarily cuts off access to these instant gratification pathways. This interruption forces a pause, making it harder to impulsively seek out those quick dopamine hits and creating an opportunity to engage in more meaningful, albeit potentially more demanding, activities that offer deeper, more sustained satisfaction."
  },
  {
    "id": "faq_025",
    "title": "How does Loomlock help us build better habits over time?",
    "link": "",
    "content": "Loomlock, as a physical timed locking container, aids in building better habits over time by facilitating consistent practice of desired behaviors and interrupting ingrained, undesirable ones. Habit formation relies heavily on repetition and reward. Each time an individual uses Loomlock to precommit to a period of focus by locking away a distraction, they are actively choosing and reinforcing a pattern of delayed gratification and intentional action. This repeated engagement in a structured, distraction-free environment helps to weaken the neural pathways associated with impulsive behaviors (like constantly checking a phone) and strengthen those related to sustained attention or healthier choices. By consistently removing the trigger for an old habit (e.g., the easily accessible smartphone) and creating space for a new one (e.g., focused work or reading), Loomlock acts as a scaffolding. Over time, this consistent practice can help to rewire the brain's reward system, making the new, more beneficial behaviors feel more automatic and less reliant on conscious effort, gradually transforming them into ingrained habits."
  },
  {
    "id": "faq_026",
    "title": "Does Loomlock work for everyone, or only if you already have some self-control?",
    "link": "",
    "content": "Loomlock is designed as a tool to assist a wide range of individuals in managing distractions and impulses, regardless of their current level of self-control. While some initial self-awareness and motivation are needed to decide to use such a device, Loomlock's primary function is to supplement existing self-control, not to require a high degree of it to be effective. For those with strong self-control, it can act as an optimizer, ensuring peak focus. For those who struggle more significantly, it provides a much-needed external structure that makes it easier to resist temptations they would otherwise succumb to. The act of precommitment—locking something away when one is feeling rational—allows individuals to bypass the need for immense willpower in moments of weakness. However, it's important to recognize that Loomlock is a tool; its effectiveness is contingent upon the user's willingness to engage with it. If an individual chooses not to use the device or actively seeks to circumvent its purpose (e.g., by consistently breaking plastic pins without an emergency), then its ability to help will be limited."
  },
  {
    "id": "faq_027",
    "title": "Why can’t I just rely on willpower?",
    "link": "",
    "content": "Relying solely on willpower to navigate the constant stream of modern temptations can be ineffective and exhausting because willpower is a finite cognitive resource, much like a muscle that can fatigue with overuse. Throughout any given day, individuals make numerous decisions and resist various minor urges, all of which draw upon this limited willpower. When faced with highly engineered distractions, such as those from smartphones or readily available unhealthy snacks, relying on willpower alone means engaging in a continuous mental battle. This constant resistance can deplete one's self-control reserves, making it harder to make good decisions later on or to focus on more demanding tasks. Loomlock, by enabling precommitment, allows individuals to conserve their willpower. By making a decision to lock something away during a moment of clarity, they offload the task of continuous resistance to the physical device, freeing up mental energy and making it easier to stay aligned with their goals without the constant strain of self-denial."
  },
  {
    "id": "faq_028",
    "title": "Isn’t it better to train myself to resist temptation directly?",
    "link": "",
    "content": "While developing the ability to resist temptation directly is a valuable skill, using a tool like Loomlock is not mutually exclusive with this goal; rather, it can be a highly effective aid in that training process. The modern environment is saturated with \"supernormal stimuli\"—distractions engineered by teams of experts to be almost irresistible. Attempting to resist these directly, especially initially or when willpower is low, can be like trying to swim against a powerful current, often leading to frustration and failure. Loomlock provides a structured way to create periods where direct resistance isn't constantly required, allowing individuals to build momentum and experience the benefits of focused work or reduced impulsive behavior. Think of it as using training wheels; it provides support while the underlying \"muscles\" of self-control are strengthened in a less overwhelming context. Moreover, Silicon Valley and other industries invest billions in tools designed to capture and retain attention. Loomlock can be seen as a personal tool to help level that playing field, providing individuals with a way to fight back and reclaim their focus during the journey of training their direct resistance."
  },
  {
    "id": "faq_029",
    "title": "What does it mean to have control over your environment vs. your mind?",
    "link": "",
    "content": "Having control over your environment often translates to having greater control over your mind because human beings are profoundly influenced by their surroundings and the cues within them. While direct mental control—the ability to command one's thoughts and impulses through sheer willpower—is an ideal, it's often difficult to achieve consistently, especially in the face of powerful external stimuli. Controlling your environment, on the other hand, involves proactively shaping your physical and digital spaces to support your goals and minimize triggers for unwanted behaviors. For instance, using Loomlock to remove a smartphone from your immediate workspace is an act of environmental control. This change in the environment reduces the mental effort required to resist the phone's allure, thereby making it easier to maintain focus (a state of mind). We are often more shaped by what surrounds us than we might like to admit; therefore, strategically managing our environment is a practical and effective way to influence our mental state and subsequent actions."
  },
  {
    "id": "faq_030",
    "title": "Isn’t discipline just about making the right choices over time?",
    "link": "",
    "content": "Fundamentally, discipline does involve consistently making the right choices over time. However, the challenge lies in how to ensure those right choices are made, especially when faced with immediate gratification that conflicts with long-term goals. Human decision-making is often influenced by present biases and fluctuating willpower. Loomlock, as a precommitment device, acts as a practical mechanism to help individuals consistently make those \"right choices\" by altering the decision-making landscape. It allows a person to make a wise choice in a moment of clarity (e.g., \"I will not use my phone for the next two hours\") and then uses a physical barrier to enforce that choice, effectively removing the option to backslide into a \"wrong choice\" (e.g., impulsively checking social media) when temptation strikes later. By making it temporarily impossible to choose the distraction, Loomlock helps ensure that the intended \"right choice\" is the one that prevails, thereby supporting the development and maintenance of discipline."
  },
  {
    "id": "faq_031",
    "title": "Why are modern distractions so much harder to resist than old ones?",
    "link": "",
    "content": "Modern distractions, particularly those emanating from digital technologies like smartphones and social media platforms, are significantly harder to resist than older forms of distraction primarily because they are meticulously engineered for addiction and continuous engagement. Companies invest billions of dollars and employ teams of behavioral psychologists, neuroscientists, and data scientists to design algorithms and user interfaces that exploit human psychological vulnerabilities. Features like variable reward schedules (similar to slot machines), instant notifications, endless scrolling, and personalized content create powerful dopamine loops that are difficult to break. Unlike a book or a board game from the past, which had natural stopping points, modern digital distractions are designed to be limitless and always available. The sheer ubiquity, personalization, and sophisticated psychological manipulation embedded in these technologies mean that individuals are not simply failing due to a lack of willpower; they are up against highly optimized systems designed to capture and retain their attention. Tools like Loomlock aim to help level this playing field by providing a physical means of disengaging from these powerfully engineered distractions."
  },
  {
    "id": "faq_032",
    "title": "How is loomlock connected to NFTs and cryptocurrencies",
    "link": "",
    "content": "Loomlock ties each collectible to a non-fungible token (NFT) recorded on a public blockchain. Because an NFT is unique, traceable, and cannot be tampered with, it acts as a fraud-proof certificate of authenticity. Whoever controls the token in their crypto wallet is recognised as the rightful owner, regardless of where the physical object resides. This on-chain proof replaces traditional paper receipts and eliminates disputes over provenance or counterfeiting. By moving ownership from the material box to its digital twin, Loomlock introduces a new model of collectible culture where transfer, trading, or verification happen instantly through cryptocurrency tools and global marketplaces."
  },
  {
    "id": "faq_033",
    "title": "What are Loomlock Credits?",
    "link": "",
    "content": "Loomlock Credits are non-transferable, on-chain loyalty points minted as soul-bound tokens (SBTs) on Blessnet. You earn them by doing more than simply buying a Loomlock; every meaningful interaction—posting a review, sharing a tutorial video, submitting a testimonial, or otherwise strengthening the community—adds to your balance. Because Credits cannot be traded or sold, they function as an authentic record of personal contribution rather than speculative assets. Accumulated Credits unlock gated benefits such as early access to limited-edition drops, priority slots in partner collaborations, and other perks reserved for the project’s most engaged supporters. In short, they convert participation into tangible rewards."
  },
  {
    "id": "faq_034",
    "title": "How do I earn Credits?",
    "link": "",
    "content": "You accumulate Loomlock Credits whenever you strengthen the ecosystem, and every qualifying action is logged instantly on Blessnet. The system also rewards network effects: if someone uses your referral link and completes their first purchase, both you and the newcomer receive a Credit boost recorded as non-transferable SBTs. Beyond commerce, meaningful content counts too—publish a testimonial, share a setup video, write a detailed review, or suggest an idea adopted by the team, and those contributions earn extra Credits once verified. Because Credits cannot be traded or sold, your growing total serves as an on-chain résumé of genuine participation that unlocks access to future drops and collaborations."
  },
  {
    "id": "faq_035",
    "title": "What makes Loomlock Credits different from regular loyalty points?",
    "link": "",
    "content": "Loomlock Credits look familiar on the surface—earn points, unlock perks—but everything underneath is tuned for transparency and fairness. Instead of sitting in a private database that only the brand can audit, each Credit is minted as a soul-bound token on Blessnet, the project’s public blockchain. That means your balance is visible to anyone, tamper-proof, and permanently tied to your wallet. Because Credits can’t be transferred or sold, they reflect genuine participation—no reseller markets, points farming, or account sharing. Earning is also broader than a simple spend-more-get-more loop: purchases, NFT collecting, referrals, and community contributions all leave an on-chain fingerprint that the system automatically rewards. Taken together, these design choices turn what used to be opaque, gameable loyalty ledgers into an open reputation layer that grows only through authentic engagement, giving every holder an auditable stake in the health of the Loomlock ecosystem."
  },
  {
    "id": "faq_036",
    "title": "Can I trade or sell my Credits?",
    "link": "",
    "content": "Loomlock Credits are deliberately non-tradable. Each Credit is minted as a soul-bound token on Blessnet.  Because the token standard disables transfer functions, you cannot send, sell, lend, or merge Credits with another wallet, nor can anyone else acquire them from you. This rule preserves the integrity of the reputation system: the only way to increase a balance is through genuine activity—buying Loomlock products, collecting official NFTs, making referrals, or contributing content. By removing the possibility of a secondary market, it disincentivizes points farming, collusion, and speculation, guaranteeing that every Credit on chain represents real participation.  In short, your Credits stay with you, forever reflecting your authentic engagement."
  },
  {
    "id": "faq_037",
    "title": "How do NFTs relate to Credits?",
    "link": "",
    "content": "Loomlock NFTs act as a high-yield multiplier for your Credit balance. When you acquire an official Loomlock NFT, the system automatically mints a far larger batch of Credits—recorded as soul-bound tokens on Blessnet—than you would receive from a standard retail purchase. This design rewards deeper commitment: collectors who secure the digital twin of a physical Loomlock signal long-term belief in the project. In return, the extra Credits you earn elevate you faster toward gated perks such as early access to limited drops, priority in collaborations, and higher-tier community roles. Because both the NFT and the Credits are stored on-chain, the link is transparent and verifiable: anyone can see that holding the NFT directly resulted in the additional, non-transferable Credits credited to your wallet."
  },
  {
    "id": "faq_038",
    "title": "What’s the difference between a regular box and a collectible box?",
    "link": "",
    "content": "A regular Loomlock box is simply a retail product—you own it the old-fashioned way, with no on-chain proof and no built-in resale mechanics. A collectible box is different: it belongs to a limited phygital drop. That NFT is the real collectible publicly verifiable, scarce, and permanently tied to your wallet while the box is its usable, display-ready twin. Because ownership tracks the token rather than the object, you can handle, lend, or even scuff the box without fear of devaluing your stake. In short, regular boxes are products, collectible boxes are NFT-backed assets whose physical form you’re free to enjoy."
  }
]